[
    {
        "header": "--- 7.1 На текстареа ----",
        "text": "Дан текстареа и абзац. Сделайте так, чтобы при наборе текста в текстареа он автоматически появлялся в этом абзаце."
    },
    {
        "header": "--- 7.2 На чекбоксы ----",
        "text": "Дан чекбокс и абзац. Сделайте так, чтобы состояние чекбокса выводилось в этот абзац. "
    },
    {
        "header": "--- 7.3 ----",
        "text": " Дан чекбокс и какой-то абзац с текстом. Сделайте так, чтобы если чекбокс отмечен - абзац был виден на экране, а если не отмечен - не видим. "
    },
    {
        "header": "--- 7.4 На селекты ----",
        "text": "Дан селект со списком городов (просто селект в HTML коде, option не из массива). Дан также абзац, в который выводится выбранный город. Сделайте так, чтобы при смене города в селекте в абзаце он также менялся."
    },
    {
        "header": "--- 7.5 ----",
        "text": "Модифицируйте предыдущую задачу так, чтобы список городов хранился в массиве из стейта."
    },
    {
        "header": "--- 7.6 На радио ----",
        "text": "Даны 3 радиокнопочки со значениями 1, 2 и 3. Дан абзац. Сделайте так, чтобы значение выбранной радиокнопочки выводилось в этот абзац."
    },
    {
        "header": "--- 7.7 Практика ----",
        "text": "Дан текстареа и кнопка. Дан также стейт texts с массивом текстов. Изначально этот массив пустой, но каждый раз по нажатию на кнопку в конец этого массива должно записаться текущее содержимое текстареа. Выведите содержимое массива this.state.texts так, чтобы каждый элемент массива выводился в новом абзаце."
    },
    {
        "header": "--- 7.8 ----",
        "text": "Дан селект со списком CSS цветов. Дан абзац. Сделайте так, чтобы при смене цвета абзац красился в выбранный цвет."
    },
    {
        "header": "--- 7.9 ----",
        "text": "Дан селект с двумя значениями: 'отмечено' и 'не отмечено'. Дан также чекбокс. Сделайте так, чтобы при изменении значения селекта, чекбокс менял свое состояние с 'отмечено' на 'не отмечено' и наоброт."
    },
    {
        "header": "--- 7.10 ----",
        "text": "Дан селект и 3 абзаца. В селекте можно выбрать один из трех пунктов. Сделайте так, чтобы в зависимости от выбора на экране был виден один из трех абзацев."
    },
    {
        "header": "--- 7.11 ----",
        "text": "Дан инпут, кнопка и селект. Сделайте следующее: в инпут вводится какая-то строка и по нажатию на кнопку эта строка должна добавится в конец селекта в виде нового option."
    }
]