[
    {
        "header": "--- 11.1 ----",
        "text": "Дан массив с работниками. У каждого работника есть имя, фамилия, количество отработанных дней и зарплатная ставка за день. Выведите этих работников на экран в виде таблицы. Сделайте так, чтобы в последней колонке автоматически рассчитывалась зарплата работника (количество отработанных дней умножить на ставку). Сделайте так, чтобы количество дней и ставка выводились в виде инпутов. Если поредактировать эти инпуты - зарплата также должна поменяться. Под таблицей также выведите суммарную зарплату всех работников. "
    },
    {
        "header": "--- 11.2 ----",
        "text": "Реализуйте тест. Дан массив с вопросами и правильными ответами. Выведите все эти вопросы на экран, а под каждым вопросом - инпут. В этот инпут пользователь должен ввести правильный ответ на вопрос. Под всеми вопросами должна находиться кнопка 'сдать тест'. По нажатию на эту кнопку под вопросами вместо инпутов должно появится следующее: 'ваш ответ такой-то, правильно' или 'ваш ответ такой-то, не правильно, правильный ответ такой-то'. Правильные ответы должны быть зеленого цвета, а неправильные - красного. "
    },
    {
        "header": "--- 11.3 ----",
        "text": "Реализуйте тест. Дан массив с вопросами и правильными ответами. Вопросы должны показываться по одному. Пользователь может двигаться по вопросам стрелками 'назад' и 'вперед'. После того, как пользователь ответит на все вопросы, должна появится кнопочка 'проверить ответы'. По нажатию на эту кнопочку нужно вывести все вопросы на экран, под вопросами должно быть следующее: 'ваш ответ такой-то, правильно' или 'ваш ответ такой-то, не правильно, правильный ответ такой-то'. Правильные ответы должны быть зеленого цвета, а неправильные - красного. "
    },
    {
        "header": "--- 11.4 ----",
        "text": "Модифицируйте предыдущую задачу так, чтобы пользователь мог выбрать один из вариантов ответа с помощью 4-х радио кнопочек. Варианты ответов также должны храниться в массиве вопросами (придумайте удобную структуру массива, чтобы там лежал и вопрос, и правильный ответ, и варианты ответов)."
    },
    {
        "header": "--- 11.5 ----",
        "text": "Модифицируйте предыдущую задачу так, чтобы пользователь мог выбрать несколько вариантов ответа с помощью 4-х чекбоксов."
    },
    {
        "header": "--- 11.6 ----",
        "text": "Реализуйте TODO-лист (чеклист). В нем должен быть список задач, которые хочет сделать пользователь. Задачу можно добавить, удалить, поредактировать. Кроме того, рядом с каждой задачей должен быть чекбокс, с помощью которого можно отметить эту задачу сделанной. Сделанная задача не удаляется из списка, а становится перечеркнутой (перечеркнуть текст можно с помощью text-decoration)."
    },
    {
        "header": "--- 11.7 ----",
        "text": "Реализуйте органайзер. Он должен представлять собой календарь за текущий месяц. По нажатию на определенную дату календаря мы должны увидеть список дел, запланированных на этот день. Каждое дело можно поредактировать, отметить сделанным или удалить, можно также добавить новое дело. Над календарем должны быть стрелочки 'назад' и 'вперед', с помощью которых можно сменить месяц и год в календаре."
    },
    {
        "header": "--- 11.8 ----",
        "text": "Реализуйте игру крестики-нолики. Играют два игрока, каждый ходит по очереди."
    }
]